tap "homebrew/bundle"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tool for exploring each layer in a docker image
brew "dive"
# Command-line DNS client
brew "dog"
# More intuitive version of du in rust
brew "dust"
# Charset analyzer and converter
brew "enca"
# Modern, maintained replacement for ls
brew "eza"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Modern, extensible Python project management
brew "hatch"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Build tool for Clojure
brew "leiningen"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Utility for managing network connections
brew "netcat"
# Simplistic interactive filtering tool
brew "peco"
# Python package management tool
brew "poetry"
# Protocol buffers (Google's data interchange format)
brew "protobuf@29"
# Python version management
brew "pyenv"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool Command Language
brew "tcl-tk"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Command-line interface for 1Password
cask "1password-cli"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Desktop client for GitHub repositories
cask "github"
# Go (golang) IDE
cask "goland"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Animated screen capture application
cask "licecap"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
vscode "adpyke.vscode-sql-formatter"
vscode "ashishalex.dataform-lsp-vscode"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hogashi.vscode-copy-github-permalink"
vscode "milovidov.escape-quotes"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-server"
vscode "msyrus.go-doc"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-upgrade"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "honnef.co/go/tools/cmd/staticcheck"
